// Задача 2:

// Console.WriteLine("Введите первое число: ");
// int numberA = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число: ");
// int numberB = Convert.ToInt32(Console.ReadLine());


// bool maxA = numberA > numberB;
// bool maxB = numberA < numberB;
// bool maxC = numberA == numberB;

// if (maxA)
// {
// Console.WriteLine($"Число {numberA} больше, чем {numberB}"); 
// }
// if (maxC)
// {
//  Console.WriteLine($"Числа {numberA} и {numberB} равны");
// }
// else
// {
//  Console.WriteLine($"Число {numberB} больше, чем {numberA}");
// }


// Задача 4:

// Console.WriteLine("Введите первое число: ");
// int a = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите второе число: ");
// int b = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите третье число: ");
// int c = Convert.ToInt32(Console.ReadLine());

// Console.Write("Максимальное число равно: ");
// Console.WriteLine(Math.Max(a, Math.Max(b, c)));
